app/controllers/api/v1/profiles_controller.rb

  def create
    if params[:profile_type] == 1
      profile = @user.create_employee(employee_params)
    elsif params[:profile_type] == 2
      profile = @user.create_sponser(sponser_params)
    elsif  params[:profile_type] == 3
      profile = @user.create_ideamaker(ideamaker_params)
---
INSERT INTO `ideamakers` (`name`, `addree`, `Gander`, `qualifiction`, `mobile`, `interstingfield`, `created_at`, `updated_at`, `user_id`, `ideamakerBio`, `Website`, `size`, `ownernaem`, `ownerphono`, `owneraddress`, `companyemail`) VALUES ('instabug', 'caire', 'male', 'asadsdas', '002151061001310', 'gdfdgdfg0', '2020-08-09 21:37:28.589549', '2020-08-09 21:37:28.589549', 2, 'ssdfasdasdasdasdasdsada', 'dwqdawdasdasdasdasd', 5, 'asdasdasdas', 'asdasdasdasd', 'dasdasdasdasdasdas', 'sadasdsadasdasdasd')